---
type: AssemblyViewUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# AssemblyViewUtils

`Autodesk.Revit.DB.AssemblyViewUtils` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AcquireAssemblyViews | 2013 | `public static void AcquireAssemblyViews ( Document document , ElementId sourceAssemblyInstanceId , ElementId targetAssemblyInstanceId )` |
| Method | Create3DOrthographic | — | `` |
| Method | CreateDetailSection | — | `` |
| Method | CreateMaterialTakeoff | — | `` |
| Method | CreatePartList | — | `` |
| Method | CreateSheet | 2012 | `public static ViewSheet CreateSheet ( Document document , ElementId assemblyInstanceId , ElementId titleBlockId )` |
| Method | CreateSingleCategorySchedule | — | `` |